
## :x: Apply Failed

[CI link](https://github.com/NaokiHaba/aws-ecs-terraform/actions/runs/10321233858)



<pre><code>Error: creating ELBv2 Listener Rule: operation error Elastic Load Balancing v2: CreateRule, https response error StatusCode: 400, RequestID: f6866019-4a32-4d29-829c-e8f301762470, api error ValidationError: Condition value &#39;*&#39; contains a character that is not valid

  with aws_lb_listener_rule.alb_listener_rule,
  on alb.tf line 27, in resource &#34;aws_lb_listener_rule&#34; &#34;alb_listener_rule&#34;:
  27: resource &#34;aws_lb_listener_rule&#34; &#34;alb_listener_rule&#34; {
</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0d3bc6321415261f2]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-013e3158ba1d87cb8]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0e85ff5b730879868]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0c861b2c5fa1a1383]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d739af6509c77909]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a24704fbcf978b51]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0be0afc03eb19635a]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0539410e12d384fea]
aws_security_group.alb: Refreshing state... [id=sg-0dc0aa69fd5dd1046]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0094ede6f5e9b43a2]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0d723ee54653a8d31]
aws_lb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:533267095025:targetgroup/go-simple-server-target-group/365fcf4d3641bd97]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0bbc16a37d4945990]
aws_security_group.ecs: Refreshing state... [id=sg-085b65b04939915ca]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-051818b3ca2c1050c]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09f94a0ef2185be8f]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-014f5e9d65c806c81]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:533267095025:loadbalancer/app/go-simple-server-alb/7dba8af0f101d717]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02b5f438bd818005a]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ae73b39760ada660]
aws_security_group_rule.alb_to_ecs: Refreshing state... [id=sgrule-1428484681]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0094ede6f5e9b43a21080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02dc7c60bbde05715]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-08d01b6dbc301047e]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d3652fd8c583d1bc]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-068c3b626f7c89750]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:533267095025:listener/app/go-simple-server-alb/7dba8af0f101d717/b0567004bccb307c]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d739af6509c779091080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0e85ff5b7308798681080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "最新の30イメージを保持"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:533267095025:listener/app/go-simple-server-alb/7dba8af0f101d717/b0567004bccb307c"
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:533267095025:targetgroup/go-simple-server-target-group/365fcf4d3641bd97"
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "*",
                ]
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-simple-server]

Error: creating ELBv2 Listener Rule: operation error Elastic Load Balancing v2: CreateRule, https response error StatusCode: 400, RequestID: f6866019-4a32-4d29-829c-e8f301762470, api error ValidationError: Condition value '*' contains a character that is not valid

  with aws_lb_listener_rule.alb_listener_rule,
  on alb.tf line 27, in resource "aws_lb_listener_rule" "alb_listener_rule":
  27: resource "aws_lb_listener_rule" "alb_listener_rule" {


```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"db67050beb73faffb1070873b971f98bb3efeed1","Vars":{},"WorkflowName":"Terraform CI/CD"} -->